// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N

Console.Write("input a number ");
int N = Convert.ToInt32(Console.ReadLine());
int i=2;

    while (i <N)
    {
       Console.Write(i);
       i=i+2; 
    }
    
    


